# TextAlignVert Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TextAlignVert Property
ParameterTypeId Class See Also
---
"Vertical Align"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TextAlignVert { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TextAlignVert As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TextAlignVert {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace